const worldAndRussianTimeline = [
    {
      "id": 1837,
      "russianhistory": "Открытие первой железной дороги (Царскосельская), смерть А.С. Пушкина.",
      "worldhistory": "Коронация королевы Виктории в Великобритании, начало Викторианской эпохи."
    },
    {
      "id": 1838,
      "russianhistory": "Усиление цензуры после публикации 'Философического письма' П.Я. Чаадаева.",
      "worldhistory": "Первое использование телеграфа Сэмюэлем Морзе в США."
    },
    {
      "id": 1839,
      "russianhistory": "Начало строительства Храма Христа Спасителя в Москве.",
      "worldhistory": "Окончание Первой Опиумной войны, подписание Нанкинского договора."
    },
    {
      "id": 1840,
      "russianhistory": "Усиление крепостного права в западных губерниях.",
      "worldhistory": "Объединение Верхней и Нижней Канады в единую провинцию Канада."
    },
    {
      "id": 1841,
      "russianhistory": "Утверждение нового Уложения о наказаниях, ужесточение уголовного права.",
      "worldhistory": "Начало активной колонизации Новой Зеландии британцами."
    },
    {
      "id": 1842,
      "russianhistory": "Реформа государственных крестьян под руководством П.Д. Киселёва.",
      "worldhistory": "Подписание Нанкинского договора, завершившего Первую Опиумную войну."
    },
    {
      "id": 1843,
      "russianhistory": "Начало строительства Николаевской железной дороги между Петербургом и Москвой.",
      "worldhistory": "Выход первого тома 'Давид Копперфильд' Чарльза Диккенса."
    },
    {
      "id": 1844,
      "russianhistory": "Основание Русского географического общества.",
      "worldhistory": "Начало активной колонизации Алжира Францией."
    },
    {
      "id": 1845,
      "russianhistory": "Утверждение нового Уголовного уложения.",
      "worldhistory": "Аннексия Техаса США, начало конфликта с Мексикой."
    },
    {
      "id": 1846,
      "russianhistory": "Усиление контроля над Царством Польским.",
      "worldhistory": "Начало американо-мексиканской войны."
    },
    {
      "id": 1847,
      "russianhistory": "Основание Киевского университета Святого Владимира.",
      "worldhistory": "Публикация 'Джейн Эйр' Шарлотты Бронте."
    },
    {
      "id": 1848,
      "russianhistory": "Подавление революционных движений в Европе, усиление консервативной политики.",
      "worldhistory": "'Весна народов' – революции во Франции, Германии, Австрии и Италии."
    },
    {
      "id": 1849,
      "russianhistory": "Участие русских войск в подавлении венгерского восстания.",
      "worldhistory": "Завершение революций в Европе, восстановление консервативных режимов."
    },
    {
      "id": 1850,
      "russianhistory": "Усиление контроля над Кавказом, продолжение Кавказской войны.",
      "worldhistory": "Компромисс 1850 года в США, временное урегулирование вопроса о рабстве."
    },
    {
      "id": 1851,
      "russianhistory": "Открытие Николаевской железной дороги между Петербургом и Москвой.",
      "worldhistory": "Великая выставка в Лондоне, демонстрация достижений промышленной революции."
    },
    {
      "id": 1852,
      "russianhistory": "Усиление цензуры после публикации 'Мёртвых душ' Н.В. Гоголя.",
      "worldhistory": "Провозглашение Второй империи во Франции, Наполеон III стал императором."
    },
    {
      "id": 1853,
      "russianhistory": "Начало Крымской войны.",
      "worldhistory": "Начало Крымской войны, конфликт между Россией и коалицией европейских держав."
    },
    {
      "id": 1854,
      "russianhistory": "Оборона Севастополя в ходе Крымской войны.",
      "worldhistory": "Оборона Севастополя, применение новых технологий в войне."
    },
    {
      "id": 1855,
      "russianhistory": "Вступление на престол Александра II.",
      "worldhistory": "Парижский конгресс, подготовка к окончанию Крымской войны."
    },
    {
      "id": 1856,
      "russianhistory": "Окончание Крымской войны, подписание Парижского мирного договора.",
      "worldhistory": "Парижский мирный договор, завершение Крымской войны."
    },
    {
      "id": 1857,
      "russianhistory": "Начало подготовки к отмене крепостного права.",
      "worldhistory": "Начало Индийского восстания (Сипайское восстание)."
    },
    {
      "id": 1858,
      "russianhistory": "Подписание Айгунского договора с Китаем, закрепление Приамурья за Россией.",
      "worldhistory": "Подавление Индийского восстания, переход управления Индией к британской короне."
    },
    {
      "id": 1859,
      "russianhistory": "Завершение Кавказской войны, покорение имамата Шамиля.",
      "worldhistory": "Публикация 'Происхождения видов' Чарльза Дарвина."
    },
    {
      "id": 1860,
      "russianhistory": "Основание Владивостока как военного поста.",
      "worldhistory": "Экспедиция 'Тысяча' Джузеппе Гарибальди, объединение Италии."
    },
    {
      "id": 1861,
      "russianhistory": "Отмена крепостного права, начало Великих реформ.",
      "worldhistory": "Начало Гражданской войны в США."
    },
    {
      "id": 1862,
      "russianhistory": "Освобождение крестьян в Царстве Польском.",
      "worldhistory": "Битва при Антиетаме, переломный момент в Гражданской войне в США."
    },
    {
      "id": 1863,
      "russianhistory": "Польское восстание, подавленное русскими войсками.",
      "worldhistory": "Прокламация об освобождении рабов в США, подписанная Авраамом Линкольном."
    },
    {
      "id": 1864,
      "russianhistory": "Судебная и земская реформы.",
      "worldhistory": "Основание Первого Интернационала (Международное товарищество рабочих)."
    },
    {
      "id": 1865,
      "russianhistory": "Освобождение крестьян в Грузии.",
      "worldhistory": "Окончание Гражданской войны в США, убийство Авраама Линкольна."
    },
    {
      "id": 1866,
      "russianhistory": "Покушение Д.В. Каракозова на Александра II.",
      "worldhistory": "Австро-прусская война, победа Пруссии."
    },
    {
      "id": 1867,
      "russianhistory": "Продажа Аляски США за 7,2 миллиона долларов.",
      "worldhistory": "Создание Австро-Венгерской империи."
    },
    {
      "id": 1868,
      "russianhistory": "Начало реформы образования.",
      "worldhistory": "Реставрация Мэйдзи в Японии, начало модернизации страны."
    },
    {
      "id": 1869,
      "russianhistory": "Начало строительства Транссибирской магистрали.",
      "worldhistory": "Открытие Суэцкого канала."
    },
    {
      "id": 1870,
      "russianhistory": "Усиление революционных настроений среди молодёжи.",
      "worldhistory": "Начало Франко-прусской войны."
    },
    {
      "id": 1871,
      "russianhistory": "Продолжение реформ, введение всеобщей воинской повинности (1874).",
      "worldhistory": "Объединение Германии, провозглашение Германской империи."
    },
    {
      "id": 1872,
      "russianhistory": "Первая всероссийская политехническая выставка в Москве.",
      "worldhistory": "Основание Йеллоустонского национального парка в США."
    },
    {
      "id": 1873,
      "russianhistory": "Создание 'Союза трёх императоров' (Россия, Германия, Австро-Венгрия).",
      "worldhistory": "Начало Великой депрессии в Европе и США."
    },
    {
      "id": 1874,
      "russianhistory": "Введение всеобщей воинской повинности.",
      "worldhistory": "Первая выставка импрессионистов в Париже."
    },
    {
      "id": 1875,
      "russianhistory": "Подписание Петербургского договора с Японией о разделе Сахалина.",
      "worldhistory": "Основание Международного бюро мер и весов."
    },
    {
      "id": 1876,
      "russianhistory": "Начало активного участия в балканских делах.",
      "worldhistory": "Изобретение телефона Александром Грэхемом Беллом."
    },
    {
      "id": 1877,
      "russianhistory": "Начало Русско-турецкой войны.",
      "worldhistory": "Великобритания провозгласила королеву Викторию императрицей Индии."
    },
    {
      "id": 1878,
      "russianhistory": "Завершение Русско-турецкой войны, Сан-Стефанский мирный договор.",
      "worldhistory": "Берлинский конгресс, пересмотр условий Сан-Стефанского договора."
    },
    {
      "id": 1879,
      "russianhistory": "Создание организации 'Народная воля', начало террористической деятельности.",
      "worldhistory": "Изобретение электрической лампы накаливания Томасом Эдисоном."
    },
    {
      "id": 1880,
      "russianhistory": "Покушение на Александра II, взрыв в Зимнем дворце.",
      "worldhistory": "Начало колониального раздела Африки."
    },
    {
      "id": 1881,
      "russianhistory": "Убийство Александра II, начало правления Александра III.",
      "worldhistory": "Начало колониального раздела Африки (Берлинская конференция, 1884–1885)."
    },
    {
      "id": 1882,
      "russianhistory": "Ужесточение цензуры и контроля над образованием.",
      "worldhistory": "Образование Тройственного союза (Германия, Австро-Венгрия, Италия)."
    },
    {
      "id": 1883,
      "russianhistory": "Коронация Александра III.",
      "worldhistory": "Открытие Бруклинского моста в Нью-Йорке."
    },
    {
      "id": 1884,
      "russianhistory": "Усиление русификации в западных губерниях.",
      "worldhistory": "Начало Берлинской конференции по разделу Африки."
    },
    {
      "id": 1885,
      "russianhistory": "Завершение присоединения Средней Азии.",
      "worldhistory": "Завершение Берлинской конференции, раздел Африки между европейскими державами."
    },
    {
      "id": 1886,
      "russianhistory": "Усиление революционного движения.",
      "worldhistory": "Основание компании Coca-Cola в США."
    },
    {
      "id": 1887,
      "russianhistory": "Покушение на Александра III, казнь участников заговора.",
      "worldhistory": "Основание Индийского национального конгресса."
    },
    {
      "id": 1888,
      "russianhistory": "Начало строительства Транссибирской магистрали.",
      "worldhistory": "Изобретение фотокамеры Kodak Джорджем Истменом."
    },
    {
      "id": 1889,
      "russianhistory": "Усиление контроля над революционными организациями.",
      "worldhistory": "Основание Второго Интернационала."
    },
    {
      "id": 1890,
      "russianhistory": "Начало экономического кризиса.",
      "worldhistory": "Принятие закона Шермана в США, направленного против монополий."
    },
    {
      "id": 1891,
      "russianhistory": "Начало строительства Транссибирской магистрали.",
      "worldhistory": "Заключение франко-русского союза."
    },
    {
      "id": 1892,
      "russianhistory": "Назначение С.Ю. Витте министром финансов.",
      "worldhistory": "Основание футбольной лиги в Англии."
    },
    {
      "id": 1893,
      "russianhistory": "Начало денежной реформы С.Ю. Витте.",
      "worldhistory": "Всемирная выставка в Чикаго."
    },
    {
      "id": 1894,
      "russianhistory": "Вступление на престол Николая II.",
      "worldhistory": "Начало японо-китайской войны."
    },
    {
      "id": 1895,
      "russianhistory": "Изобретение радио А.С. Поповым.",
      "worldhistory": "Открытие рентгеновских лучей Вильгельмом Рентгеном."
    },
    {
      "id": 1896,
      "russianhistory": "Ходынская трагедия во время коронации Николая II.",
      "worldhistory": "Первые современные Олимпийские игры в Афинах."
    },
    {
      "id": 1897,
      "russianhistory": "Денежная реформа С.Ю. Витте, введение золотого стандарта.",
      "worldhistory": "Основание сионистского движения Теодором Герцлем."
    },
    {
      "id": 1898,
      "russianhistory": "Основание Московского художественного театра (МХТ).",
      "worldhistory": "Испано-американская война, победа США."
    },
    {
      "id": 1899,
      "russianhistory": "Начало активного участия в международных конфликтах (Боксёрское восстание).",
      "worldhistory": "Начало Англо-бурской войны."
    },
    {
      "id": 1900,
      "russianhistory": "Участие в подавлении Боксёрского восстания в Китае.",
      "worldhistory": "Восстание боксёров в Китае, подавленное международной коалицией."
    },
    {
      "id": 1901,
      "russianhistory": "Усиление революционного движения.",
      "worldhistory": "Создание Нобелевской премии."
    },
    {
      "id": 1902,
      "russianhistory": "Начало аграрных волнений.",
      "worldhistory": "Окончание Англо-бурской войны."
    },
    {
      "id": 1903,
      "russianhistory": "II съезд РСДРП, раскол на большевиков и меньшевиков.",
      "worldhistory": "Первый полёт братьев Райт."
    },
    {
      "id": 1904,
      "russianhistory": "Начало Русско-японской войны.",
      "worldhistory": "Начало Русско-японской войны."
    },
    {
      "id": 1905,
      "russianhistory": "Кровавое воскресенье, начало Первой русской революции.",
      "worldhistory": "Образование независимой Норвегии."
    },
    {
      "id": 1906,
      "russianhistory": "Начало работы I Государственной Думы.",
      "worldhistory": "Принятие Закона о чистой пище и лекарствах в США."
    }
  ]

  const KAV = [
    {
      "id": "1",
      "title": "Рождение",
      "date": "1837-02-20",
      "age": "0",
      "sort_descr": "Родился Константин Александрович Висковатов.",
      "full_descr": "Константин Александрович Висковатов, пятый сын Александра Васильевича Висковатова, родился 20 февраля 1837 года в Санкт-Петербурге, Российская империя. В семье уже были старшие дети: Василий (5 лет), Александр (4 года), Николай (2 года). Старший ребенок, Михаил, умер в младенчестве за 7 лет до рождения Константина [ЦГИА. Ф.19. О.111. Д.286-4].",
      "url": "img/cgia_f111_o11_d1.jpg",
      "storyImage": "img/birth.jpg",
      places: [
        { id: 1, type: "address", status: "active" }, // Место жительства
      ],
      family: [
       { id: "G3M-1VIV-AVV", type: "parents", status: "alive"},
       { id: "G3F-S1AVV-PFB", type: "parents", status: "alive"},
       { id: "G4M-1AVV-MAV", type: "siblings", status: "dead"},
       { id: "G4M-2AVV-VAV", type: "siblings", status: "alive"},
       { id: "G4M-3AVV-AAV", type: "siblings", status: "alive"},
       { id: "G4M-4AVV-NAV", type: "siblings", status: "alive"},
       { id: "G4M-5AVV-KAV", type: "siblings", status: "alive"},
      ]
    },
    {
      "id": "2",
      "title": "Рождение сестры Марии и брата Владимира",
      "date": "1838-08-15",
      "age": "1",
      "sort_descr": "Родились сестра Мария и брат Владимир.",
      "full_descr": "В семье Висковатовых родились сестра Мария и брат Владимир. Константину на тот момент был 1 год.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "storyImage": "img/siblings.jpg",
      family: [
        { id: "G4M-6AVV-VAV", type: "siblings", status: "alive"},
        { id: "G4F-7AVV-MarAV", type: "siblings", status: "alive"}]
     },
     {
     "id": "3",
     "title": "Смерть сестры Марии",
     "date": "1839-04-14",
     "age": "2",
     "sort_descr": "Умерла сестра Мария.",
     "full_descr": "Умерла сестра Мария, Константину на тот момент был 2 года.",
     "url": "img/cgia_f111_o11_d1.jpg",
     "storyImage": "img/siblings.jpg",
     family: [
       { id: "G4F-7AVV-MarAV", type: "siblings", status: "dead"}]
    },

    {
      "id": "4",
      "title": "Рождение брата Павла",
      "date": "1842-11-24",
      "age": "5",
      "sort_descr": "Родился брат Павел.",
      "full_descr": "В семье Висковатовых родился брат Павел. Константину на тот момент было 5 лет.",
      "url": "img/cgia_f111_o11_d1.jpg",
      family: [
        { id: "G4M-8AVV-PAV", type: "siblings", status: "alive"}]

    },
    {
      "id": "5",
      "title": "Рождение брата Валериана",
      "date": "1845-09-17",
      "age": "8",
      "sort_descr": "Родился брат Валериан.",
      "full_descr": "В семье Висковатовых родился брат Валериан. Константину на тот момент было 8 лет.",
      "url": "img/cgia_f111_o11_d1.jpg",
      places: [
        { id: 2, type: "education", status: "active" }, // Образование
      ],
      family: [
        { id: "G4M-9AVV-ValAV", type: "siblings", status: "alive"}]
    },
    {
      "id": "6",
      "title": "Начало учебы в Александровском лицее",
      "date": "1851-08-16",
      "age": "14",
      "sort_descr": "Константин поступил в Александровский лицей.",
      "full_descr": "Константин поступил в Александровский лицей.",
      "url": "img/cgia_f111_o11_d1.jpg",
      places: [
        { id: 2, type: "education", status: "active" }, // Образование
      ],
   },

    {
      "id": "7",
      "title": "Окончание Александровского лицея",
      "date": "1857",
      "age": "20",
      "sort_descr": "Константин окончил Александровский лицей.",
      "full_descr": "В 1857 году Константин Александрович окончил Александровский лицей с чином коллежского секретаря. Сразу после выпуска, 7 июня того же года, он написал шутливое письмо своему лицейскому другу, будущему министру Андрею Александровичу Сабурову, адресованное \"Душа-Андрюша\".",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"22",
      places: [
        { id: 2, type: "education", status: "completed" }, // Образование
      ],    },
    {
      "id": "8",
      "title": "Начало службы в Департаменте уделов",
      "date": "1857-12-28",
      "age": "20",
      "sort_descr": "Назначен на службу в Департамент уделов.",
     "full_descr": "Согласно высочайшему приказу от 5 января 1858 года, Константин Александрович был определен на службу в Департамент уделов с 28 декабря 1857 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":"250"},
      "status":"22",
      places: [
        { id: 3, type: "job", status: "active" }, // Работа
      ]
      
    },
    {
      "id": "9",
      "title": "Смерть отца",
      "date": "1858-02-27",
      "age": "21",
      "sort_descr": "Скончался отец Константина Александровича.",
      "full_descr": "Отец Константина, Александр Васильевич Висковатов, скончался от аневризмы в возрасте 53 лет. Константину на тот момент был 21 год.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"22",
      "revenue": {"lumpsum":"", "annually":"250"},
      family: [
        { id: "G3M-1VIV-AVV", type: "parents", status: "dead"}] 
    },
    {
      "id": "10",
      "title": "Отпуск",
      "date": "1858-06-10",
      "age": "21",
      "sort_descr": "Константин ушел в отпуск на 3 месяца.",
      "full_descr": "Константин Александрович взял отпуск на 3 месяца, начиная с 10 июня 1858 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"22",
      "revenue": {"lumpsum":"", "annually":"250"},
    },
    {
      "id": "11",
      "title": "Перевод в Государственную канцелярию",
      "date": "1858-10-22",
      "age": "21",
      "sort_descr": "Переведен в Государственную канцелярию.",
      "full_descr": "По приказу Государственного секретаря, Константин Александрович был переведен на службу в Государственную канцелярию сверхштатным чиновником и назначен для занятий в Отделении дел Государственного секретаря 22 октября 1858 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"22",
      "revenue": {"lumpsum":"", "annually":"250"},
      places: [
        { id: 3, type: "job", status: "completed" }, 
        { id: 4, type: "job", status: "active" }, 
      ]
    },

    {
      "id": "12",
      "title": "Работа в Канцелярии Редакционных комиссий",
      "date": "1859-10-17",
      "age": "22",
      "sort_descr": "Назначен для занятий в Канцелярии Редакционных комиссий.",
      "full_descr": "В октябре 1859 года Константин Александрович был назначен для занятий в Канцелярии Редакционных комиссий, учрежденных для составления положений об освобождении крестьян из крепостной зависимости.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"22",
      "revenue": {"lumpsum":"", "annually":"250"},
      places: [
        { id: 5, type: "job", status: "active" }, 
      ]

    },
    {
      "id": "13",
      "title": "Женитьба на Генриетте Эдуардовне Мюральт",
      "date": "1860-10-10",
      "age": "23",
      "sort_descr": "Женитьба на Генриетте Эдуардовне Мюральт.",
      "full_descr": "Невеста - дочь старшего библиотекаря Государственной публичной библиотеки девица Генриетта Эдуардовна Мюральт, реформатского вероисповедания. Венчание состоялось в Исаакиевском соборе.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"22",
      "revenue": {"lumpsum":"", "annually":"250"},
      places: [
        { id: 5, type: "job", status: "active" }, 
      ],
      family: [
        { id: "G4F-S1AVV-GEM", type: "spouses", status: "alive"}]
    },
    {
      "id": "14",
      "title": "Награда за труды по освобождению крестьян",
      "date": "1860-12-31",
      "age": "23",
      "sort_descr": "Получил награду за труды по освобождению крестьян.",
      "full_descr": "За свои труды в Канцелярии Редакционных комиссий Константин Александрович был награжден единовременной суммой в 250 рублей 31 декабря 1860 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"250", "annually":"250"},      
      "status":"22"
    },
    {
      "id": "15",
      "title": "Производство в титулярные советники",
      "date": "1861-02-16",
      "age": "23",
      "sort_descr": "Произведен в титулярные советники.",
      "full_descr": "Определением Департамента герольдии Правительствующего Сената 16 февраля 1861 года Константин Александрович был произведен в титулярные советники со старшинством с 28 декабря 1860 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"1",
      "revenue": {"lumpsum":"", "annually":"500"},
      places: [
        { id: 5, type: "job", status: "completed" }, 
      ]
    },
    {
      "id": "16",
      "title": "Назначение младшим помощником экспедитора",
      "date": "1861-04-01",
      "age": "24",
      "sort_descr": "Назначен младшим помощником экспедитора.",
      "full_descr": "Приказом Государственного секретаря Константин Александрович был назначен младшим помощником экспедитора 1 апреля 1861 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"1",
      "revenue": {"lumpsum":"", "annually":"500"},
      places: [
        { id: 4, type: "job", status: "active" }, 
      ]
    },
    {
      "id": "17",
      "title": "Производство в коллежские асессоры",
      "date": "1861-04-23",
      "age": "24",
      "sort_descr": "Произведен в коллежские асессоры.",
      "full_descr": "За отличие по службе и особые труды по крестьянскому делу Константин Александрович был произведен в коллежские асессоры 23 апреля 1861 года и получил серебряную медаль за труды по освобождению крестьян.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "storyImage": "img/silver-medal.png",
      "status":"2",
      "revenue": {"lumpsum":"", "annually":"600"},
      "medals":"1",
      places: [
        { id: 3, type: "job", status: "active" }, 

      ]
    },

    {
      "id": "18",
      "title": "Назначение старшим помощником экспедитора",
      "date": "1861-11-19",
      "age": "24",
      "sort_descr": "Назначен старшим помощником экспедитора.",
      "full_descr": "Приказом Государственного секретаря Константин Александрович был назначен старшим помощником экспедитора 19 ноября 1861 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"2",
      "revenue": {"lumpsum":"", "annually":"600"},
      places: [
        { id: 1, type: "job", status: "active" }, 

      ]

    },
    {
      "id": "19",
      "title": "Награда в 450 рублей",
      "date": "1862-01-01",
      "age": "24",
      "sort_descr": "Получил награду в 450 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 450 рублей 1 января 1862 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"450", "annually":"600"},      
      "status":"2",
      places: [
        { id: 2, type: "job", status: "active" }, 

      ]
    },
    {
      "id": "20",
      "title": "Рождение сына Александра",
      "date": "1862-03-18",
      "age": "25",
      "sort_descr": "Родился сын Александр.",
      "full_descr": "У Константина Александровича и Генриетты Эдуардовны родился сын Александр 18 марта 1862 года. Восприемницей новорожденного стала прабабушка Шарлотта Кондратьевна, мать А.В.В. [ЦГИА. Ф.19. О.124. Д.831].",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"2",
      "revenue": {"lumpsum":"", "annually":"600"},
      family: [
        { id: "G5M-1KAV-AKV", type: "kids", status: "alive"}]
    },

    {
      "id": "21",
      "title": "Производство в надворные советники",
      "date": "1862-12-30",
      "age": "25",
      "sort_descr": "Произведен в надворные советники.",
      "full_descr": "Константин Александрович был произведен в надворные советники 30 декабря 1862 года и получил награду в 400 рублей.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"", "annually":"600"},
    },
    {
      "id": "22",
      "title": "Награда в 1000 рублей",
      "date": "1863-12-30",
      "age": "26",
      "sort_descr": "Получил награду в 1000 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1000 рублей 30 декабря 1863 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"1000", "annually":"600"},
    },
    {
      "id": "23",
      "title": "Награда в 500 рублей",
      "date": "1864-07-02",
      "age": "27",
      "sort_descr": "Получил награду в 500 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 500 рублей 2 июля 1864 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"500", "annually":"600"},
    },
    {
      "id": "24",
      "title": "Смерть первой жены",
      "date": "1864-07-04",
      "age": "27",
      "sort_descr": "Скончалась Генриетта Эдуардовна Мюральт.",
      "full_descr": "Генриетта Эдуардовна Мюральт скончалась 4 июля 1864 года и была похоронена на Волковском лютеранском кладбище [ЦГИА СПб. ф.373. оп.1. д.29].",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"", "annually":"600"},
      family: [
        { id: "G4F-S1AVV-GEM", type: "spouses", status: "dead"}]
    },
    {
      "id": "25",
      "title": "Награда в 1000 рублей",
      "date": "1864-08-01",
      "age": "27",
      "sort_descr": "Получил награду в 1000 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1000 рублей 1 августа 1864 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"1000", "annually":"600"},
    },
    {
      "id": "26",
      "title": "Награда в 1000 рублей",
      "date": "1864-10-01",
      "age": "27",
      "sort_descr": "Получил награду в 1000 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1000 рублей 1 октября 1864 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"1000", "annually":"600"},
    },
    {
      "id": "27",
      "title": "Награда в 800 рублей",
      "date": "1864-12-03",
      "age": "27",
      "sort_descr": "Получил награду в 800 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 800 рублей 3 декабря 1864 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"3",
      "revenue": {"lumpsum":"800", "annually":"600"},
    },
    {
      "id": "28",
      "title": "Производство в коллежские советники",
      "date": "1864-12-31",
      "age": "27",
      "sort_descr": "Произведен в коллежские советники.",
      "full_descr": "Константин Александрович был произведен за отличие в коллежские советники 31 декабря 1864 года и назначен экспедитором.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"4",
      "revenue": {"lumpsum":"", "annually":"600"},
    },
    {
      "id": "29",
      "title": "Добавочное содержание 800 рублей в год",
      "date": "1865-01-01",
      "age": "27",
      "sort_descr": "Получил добавочное содержание 800 рублей в год.",
      "full_descr": "С 1 января 1865 года Константин Александрович получал добавочное содержание в размере 800 рублей в год.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"4",
      "revenue": {"lumpsum":"", "annually":"800"},
    },
    {
      "id": "30",
      "title": "Награда в 1200 рублей",
      "date": "1865-06-01",
      "age": "28",
      "sort_descr": "Получил награду в 1200 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1200 рублей 1 июня 1865 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"4",
      "revenue": {"lumpsum":"1200", "annually":"800"},
    },
    {
      "id": "31",
      "title": "Производство в статские советники",
      "date": "1866-01-01",
      "age": "28",
      "sort_descr": "Произведен в статские советники.",
      "full_descr": "Константин Александрович был произведен за отличие в статские советники 1 января 1866 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"5",
      "revenue": {"lumpsum":"", "annually":"800"},
    },
    {
      "id": "32",
      "title": "Награда в 1000 рублей",
      "date": "1866-01-06",
      "age": "28",
      "sort_descr": "Получил награду в 1000 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1000 рублей 6 января 1866 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"5",
      "revenue": {"lumpsum":"1000", "annually":"800"},
    },
    {
      "id": "33",
      "title": "Назначение помощником статс-секретаря Госсовета",
      "date": "1866-05-02",
      "age": "29",
      "sort_descr": "Назначен помощником статс-секретаря Госсовета.",
      "full_descr": "Именным высочайшим указом Константин Александрович был назначен помощником статс-секретаря Госсовета, управляющим архивом и казначейской частью Госканцелярии 2 мая 1866 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"5",
      "revenue": {"lumpsum":"", "annually":"800"},
    },
    {
      "id": "34",
      "title": "Добавочное содержание 1000 рублей в год",
      "date": "1866-06-02",
      "age": "29",
      "sort_descr": "Получил добавочное содержание 1000 рублей в год.",
      "full_descr": "С 2 июня 1866 года Константин Александрович получал добавочное содержание в размере 1000 рублей в год.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":"1000"},
      "status":"5",
    },
    {
      "id": "35",
      "title": "Второй брак",
      "date": "1868",
      "age": "30",
      "sort_descr": "Женился на Елизавете Яковлевне Кульневой.",
      "full_descr": "В 1868 году Константин Александрович вступил во второй брак с Елизавета Яковлевной Кульневой. В этот день он написал ей письмо из Москвы, где описывал свои планы по найму горничной и упоминал родственников.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"5",
      "revenue": {"lumpsum":"", "annually":"1000"},
      family: [
        { id: "G4F-S2AVV-EYK", type: "spouses", status: "alive"}]
    },
    
    {
      "id": "36",
      "title": "Награда в 2500 рублей",
      "date": "1868-02-04",
      "age": "30",
      "sort_descr": "Получил награду в 2500 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 2500 рублей 4 февраля 1868 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"5",
      "revenue": {"lumpsum":"2500", "annually":"1000"},
    },
    {
      "id": "37",
      "title": "Производство в действительные статские советники",
      "date": "1869-01-01",
      "age": "31",
      "sort_descr": "Произведен в действительные статские советники.",
      "full_descr": "Константин Александрович был произведен за отличие в действительные статские советники 1 января 1869 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
    },
    {
      "id": "38",
      "title": "Смерть матери",
      "date": "1869-04-02",
      "age": "31",
      "sort_descr": "Скончалась мать Константина Александровича.",
      "full_descr": "Мать Константина, Паулина Федоровна, скончалась 2 апреля 1869 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
      family: [
        { id: "G3F-S1AVV-PFB", type: "parents", status: "dead"}] 
    },
    {
      "id": "39",
      "title": "Назначение при Председателе Госсовета",
      "date": "1869-12-31",
      "age": "31",
      "sort_descr": "Назначен при Председателе Госсовета.",
      "full_descr": "Константин Александрович был назначен при Председателе Госсовета 31 декабря 1869 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
    },
    {
      "id": "40",
      "title": "Работа в архивах",
      "date": "1870",
      "age": "33-43",
      "sort_descr": "Работа в архивах и публикация трудов отца.",
      "full_descr": "В 1870-х годах Константин Александрович активно занимался архивной работой и публикацией незавершенных трудов своего отца, включая \"Историческое описание\" и \"Барклай де Толли. Некоторые эпизоды из его жизни\" [ИРЛИ (Пушкинский Дом). Архив журнала «Русская Старина», № 2687, ф. 265, оп. 2, № 123].",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
    },
    {
      "id": "41",
      "title": "Награда в 3000 рублей",
      "date": "1871-01-01",
      "age": "33",
      "sort_descr": "Получил награду в 3000 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 3000 рублей 1 января 1871 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"3000", "annually":"1000"},
    },
    {
      "id": "42",
      "title": "Назначение в Особую комиссию",
      "date": "1871-12-01",
      "age": "33",
      "sort_descr": "Назначен в Особую комиссию.",
      "full_descr": "Константин Александрович был назначен в Особую комиссию, учрежденную при императорском археологическом обществе для обсуждения вопроса устройства архивов и хранения в них документов 1 декабря 1871 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
    },
    {
      "id": "43",
      "title": "Награда орденом Св. Владимира 3 степени",
      "date": "1872-01-01",
      "age": "34",
      "sort_descr": "Получил орден Св. Владимира 3 степени.",
      "full_descr": "Константин Александрович был награжден орденом Св. Владимира 3 степени 1 января 1872 года за отлично усердную службу.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
      "medals":"2"
    },
    {
      "id": "44",
      "title": "Награда орденом Св. Станислава 1 степени",
      "date": "1874-01-01",
      "age": "36",
      "sort_descr": "Получил орден Св. Станислава 1 степени.",
      "full_descr": "Константин Александрович был награжден орденом Св. Станислава 1 степени 1 января 1874 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
      "medals":"3"
    },
    {
      "id": "45",
      "title": "Награда в 1500 рублей",
      "date": "1874-04-14",
      "age": "36",
      "sort_descr": "Получил награду в 1500 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1500 рублей 14 апреля 1874 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"1500", "annually":"1000"},
    },
    {
      "id": "46",
      "title": "Награда в 1500 рублей",
      "date": "1875",
      "age": "37",
      "sort_descr": "Получил награду в 1500 рублей.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1500 рублей в 1875 году.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"1500", "annually":"1000"},
    },
    {
      "id": "47",
      "title": "Освобождение от обязанностей заведующего казначейской частью",
      "date": "1876-05-10",
      "age": "38",
      "sort_descr": "Освобожден от обязанностей заведующего казначейской частью.",
      "full_descr": "Константин Александрович был освобожден от обязанностей заведующего казначейской и хозяйственной частями Госканцелярии 10 мая 1876 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
    },
    {
      "id": "48",
      "title": "Рождение дочери Ольги",
      "date": "1878-01-15",
      "age": "40",
      "sort_descr": "Родилась дочь Ольга.",
      "full_descr": "У Константина Александровича и Елизаветы Яковлевны родилась дочь Ольга 15 января 1878 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":"1000"},
      family: [
        { id: "G5F-2KAV-OKV", type: "kids", status: "alive"}]
    },
    {
      "id": "49",
      "title": "Награда в 1500 рублей в год",
      "date": "1878-04-24",
      "age": "40",
      "sort_descr": "Получил награду в 1500 рублей в год.",
      "full_descr": "Константин Александрович был награжден единовременной суммой в 1500 рублей в год на протяжении 12 лет 24 апреля 1878 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":1000+1500},
    },
    {
      "id": "50",
      "title": "Аукционная продажа вещей",
      "date": "1878-05-20",
      "age": "40",
      "sort_descr": "В газете объявлена аукционная продажа движемого имущества",
      "full_descr": "В газете объявлена аукционная продажа движемого имущества (мебель и книги) по Казанской улице 54-18",
      "url": "img/1878_05_20.jpg",
      "status":"6",
    },
    {
      "id": "51",
      "title": "Процесс выкупа земли крестьянами",
      "date": "1868-11-20",
      "age": "31",
      "sort_descr": "Процесс выкупа земли крестьянами у Елизаветы Яковлевны",
      "full_descr": "С 20 ноября 1868 года по 25 июля 1879 года шел процесс выкупа крестьянами земельных участков у Елизаветы Яковлевны в ее имении в Нижегородской губернии.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "status":"6",
      "revenue": {"lumpsum":"", "annually":1000+1500},
    },
    {
      "id": "52",
      "title": "Отставка",
      "date": "1879-03-05",
      "age": "41",
      "sort_descr": "Вышел в отставку.",
      "full_descr": "Константин Александрович вышел в отставку по домашним обстоятельствам с правом носить мундир последней должности и назначенной пенсией от казны в размере 3000 рублей в год.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
    },
    {
      "id": "53",
      "title": "Рождение дочери Екатерины",
      "date": "1883",
      "age": "45",
      "sort_descr": "Родилась дочь Екатерина.",
      "full_descr": "У Константина Александровича и Елизаветы Яковлевны родилась дочь Екатерина в 1883 году.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5F-3KAV-EKV", type: "kids", status: "alive"}]
    },

    {
      "id": "54",
      "title": "Развод с Елизаветой Яковлевной Кульневой",
      "date": "1883-02-04",
      "age": "45",
      "sort_descr": "Развод с Елизаветой Яковлевной Кульневой.",
      "full_descr": "Константин Александрович развелся с Елизаветой Яковлевной Кульневой 4 февраля 1883 года. Елизавета Яковлевна упоминается в документах до 1890 года, дата ее смерти неизвестна.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G4F-S2AVV-EYK", type: "spouses", status: "divorce"}]

    },
    {
      "id": "55",
      "title": "Третий брак",
      "date": "1885-09-15",
      "age": "48",
      "sort_descr": "Женился на Генриетте Николаевне Гедда.",
      "full_descr": "Константин Александрович вступил в третий брак с Генриеттой Николаевной Гедда 15 сентября 1885 года. Невесте было 27 лет.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G4F-S3AVV-GNG", type: "spouses", status: "alive"}]
    },
    {
    "id": "56",
    "title": "Смерть брата Валериана",
    "date": "1886-07-20",
    "age": "49",
    "sort_descr": "Родился брат Валериан.",
    "full_descr": "В семье Висковатовых родился брат Валериан. Константину на тот момент было 8 лет.",
    "url": "img/cgia_f111_o11_d1.jpg",
    family: [
      { id: "G4M-9AVV-ValAV", type: "siblings", status: "dead"}]
  },

    {
      "id": "57",
      "title": "Рождение близнецов Константина и Веры",
      "date": "1886-09-02",
      "age": "49",
      "sort_descr": "Родились близнецы Константин и Вера.",
      "full_descr": "У Константина Александровича и Генриетты Николаевны родились близнецы Константин и Вера 2 сентября 1886 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5M-4KAV-KKV", type: "kids", status: "alive"},
        { id: "G5F-5KAV-VKV", type: "kids", status: "alive"}]
    },

    {
      "id": "58",
      "title": "Смерть дочери Екатерины",
      "date": "1888-07-25",
      "age": "51",
      "sort_descr": "Скончалась дочь Екатерина.",
      "full_descr": "Дочь Екатерина скончалась в возрасте 5 лет от воспаления легких 25 июля 1888 года. Она была похоронена на Волковском православном кладбище.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5F-3KAV-EKV", type: "kids", status: "dead"}]
    },
    {
      "id": "59",
      "title": "Рождение сына Федора",
      "date": "1889-10-09",
      "age": "52",
      "sort_descr": "Родился сын Федор.",
      "full_descr": "У Константина Александровича и Генриетты Николаевны родился сын Федор 9 октября 1889 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5M-6KAV-FKV", type: "kids", status: "alive"}]
    },
    {
      "id": "60",
      "title": "Рождение сына Ивана",
      "date": "1891-01-04",
      "age": "53",
      "sort_descr": "Родился сын Иван.",
      "full_descr": "У Константина Александровича и Генриетты Николаевны родился сын Иван 4 января 1891 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",      
      family: [
        { id: "G5M-7KAV-IKV", type: "kids", status: "alive"}]
    },

    {
      "id": "61",
      "title": "Рождение сына Михаила",
      "date": "1891-10-04",
      "age": "54",
      "sort_descr": "Родился сын Михаил.",
      "full_descr": "У Константина Александровича и Генриетты Николаевны родился сын Михаил 4 октября 1891 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5M-8KAV-MKV", type: "kids", status: "alive"}]
    },

    {
      "id": "62",
      "title": "Рождение воспитанника Александра Григорьевича Григорьева",
      "date": "1898",
      "age": "61",
      "sort_descr": "Родился воспитанник Александр Григорьевич Григорьев.",
      "full_descr": "Родился воспитанник Александр Григорьевич Григорьев, который вскоре был взят в семью Константина Александровича.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5M-9KAV-AGG", type: "kids", status: "alive"}]
    },

    {
      "id": "63",
      "title": "Рождение дочери Елизаветы",
      "date": "1900-10-19",
      "age": "63",
      "sort_descr": "Родилась дочь Елизавета.",
      "full_descr": "У Константина Александровича и Генриетты Николаевны родилась дочь Елизавета 19 октября 1900 года.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G5F-10KAV-ElKV", type: "kids", status: "alive"}]
    },
    {
      "id": "64",
      "title": "Смерть брата Василия",
      "date": "1902-09-28",
      "age": "49",
      "sort_descr": "Умер брат Василий.",
      "full_descr": "Смерть брата Василия",
      "url": "img/cgia_f111_o11_d1.jpg",
      family: [
        { id: "G4M-2AVV-VAV", type: "siblings", status: "dead"}]
    },
    {
      "id": "65",
      "title": "Смерть брата Николая",
      "date": "1903-06-13",
      "age": "49",
      "sort_descr": "Умер брат Николай.",
      "full_descr": "Смерть брата Николая.",
      "url": "img/cgia_f111_o11_d1.jpg",
      family: [
        { id: "G4M-4AVV-NAV", type: "siblings", status: "dead"}]
    },
  {
    "id": "66",
    "title": "Смерть брата Павла",
    "date": "1905-04-16",
    "age": "49",
    "sort_descr": "Умер брат Павел.",
    "full_descr": "Смерть брата Павла Александровича Висковатова.",
    "url": "img/cgia_f111_o11_d1.jpg",
    family: [
      { id: "G4M-8AVV-PAV", type: "siblings", status: "dead"}]
  },
    {
      "id": "67",
      "title": "Удар",
      "date": "1905",
      "age": "68",
      "sort_descr": "У Константина Александровича случался удар, после которого он был прикован к креслу.",
      "full_descr": "В 1905 году в Вырице Константин Александрович услышал новость о крушении поезда, на котором ехала его жена Генриетта Николаевна, в этот момент у него случился удар, после которого Константин Александрович был частично парализован. Новость о крушении была ошибочной -- авария произошла с другим поездом.",
      "url": "img/cgia_f111_o11_d1.jpg",
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
       
    },
    {
      "id": "68",
      "title": "Смерть",
      "date": "1906-11-01",
      "age": "69",
      "sort_descr": "Скончался Константин Александрович Висковатов.",
      "full_descr": "Константин Александрович Висковатов скончался 1 ноября 1906 года в Вырице, Гатчинский район, Ленинградская область, Россия. Он был похоронен на Волковском лютеранском кладбище, но его могила не сохранилась.",
      "url": "img/cgia_f111_o11_d1.jpg", 
      "revenue": {"lumpsum":"", "annually":3000+1500},
      "status":"6",
      family: [
        { id: "G4M-5AVV-KAV", type: "siblings", status: "dead"}]
    }
  ];

  const medalsData = [
    { id: 1, image: "img/krestiane.png", name: "За труды по освобождению крестьян", describtion: "Памятная награда Российской Империи, учрежденная в 1861 году в честь отмены крепостного права. Медаль вручалась чиновникам, государственным деятелям и другим лицам, которые активно участвовали в подготовке и реализации крестьянской реформы. Она изготавливалась из серебра и имела на лицевой стороне изображение императора Александра II, а на оборотной — надпись «За труды по освобождению крестьян». Медаль носилась на Александровской ленте и символизировала признание заслуг в проведении одной из важнейших реформ XIX века. Эта награда стала символом прогрессивных изменений в обществе и государстве. После революции 1917 года медаль утратила официальный статус."
    },
    { id: 2, image: "img/vladimir3.png", name: "Орден св. Владимира 3ст", describtion: "Учрежден в 1782 году императрицей Екатериной II в честь князя Владимира Крестителя. Орден имел четыре степени, 3 степень предназначалась для награждения за значительные заслуги на гражданской или военной службе. Он вручался чиновникам, военным и общественным деятелям за выдающиеся достижения, включая успехи в управлении, науке, искусстве или благотворительности. Кавалеры ордена получали право на потомственное дворянство, что подчеркивало его высокий статус. Орден Святого Владимира 3 степени представлял собой золотой крест с красной и черной эмалью, который носили на ленте на шее. Эта награда символизировала не только личные заслуги, но и преданность государству. После революции 1917 года орден был упразднен."
    },
    { id: 3, image: "img/stanislav1.png", name: "Орден св. Станислава 1ст", describtion: "Учрежден в 1765 году польским королем Станиславом Августом Понятовским, после включения Польши в состав России в 1831 году вошел в систему российских наград. Орден вручался за гражданские и военные заслуги, а также за благотворительную деятельность. Он имел три степени, причем 1 степень была высшей и предназначалась для награждения высокопоставленных чиновников, военных и общественных деятелей. Кавалеры ордена получали право на потомственное дворянство, что делало его особенно престижным. Орден Святого Станислава 1 степени украшался золотым крестом с красной эмалью, звездой и лентой, которую носили через плечо. Эта награда символизировала не только личные заслуги, но и высокое доверие со стороны императора. После революции 1917 года орден был упразднен."
    },
    // Добавьте больше медалей по мере необходимости
  ];

  const statusData = [
    { id: 1, image: "img/medal1.png", name: "Титулярный советник", describtion: "Гражданский чин IX класса в Табели о рангах Российской империи, введенный Петром I в 1722 году. Этот чин соответствовал званию капитана в армии или ротмистра в кавалерии. Титулярные советники занимали средние должности в государственных учреждениях, таких как министерства, губернские правления или суды. Получение этого чина давало право на личное дворянство, что делало его важным этапом в карьере чиновника. Титулярные советники часто выполняли ответственные задачи, связанные с делопроизводством и управлением, но при этом оставались на достаточно скромном уровне в иерархии государственной службы. Этот чин упоминается в литературе, например, у Гоголя в «Шинели», где главный герой Акакий Акакиевич Башмачкин является титулярным советником, что подчеркивает его скромное положение в обществе."
    },
    { id: 2, image: "img/medal2.png", name: "Орден св. Владимира 3ст", describtion: "Доходный дом там то и там то построен тем то соседи в это время те то и те то"
    },
    // Добавьте больше медалей по мере необходимости
  ];

  const places = [
    { id: 1, 
      image: "img/dohodniy.png", 
      name: "Санкт-Петербург, Центральная, д.5",
      describtion: "Доходный дом там то и там то построен тем то соседи в это время те то и те то"
    },
    { id: 2, 
      image: "img/al-licey2.png", 
      name: "Александровский Императорский Лицей",
      describtion:"Одно из самых престижных учебных заведений Российской империи, основанное в 1811 году по указу императора Александра I. Лицей был создан для подготовки государственных деятелей и находился в Царском Селе. Наиболее известным выпускником лицея стал Александр Пушкин, чьи годы учебы там оставили значительный след в его творчестве. Обучение в лицее длилось шесть лет и включало широкий спектр дисциплин: от гуманитарных наук до математики и военного дела. Лицей славился своими прогрессивными методами обучения и воспитания, а также духом свободомыслия. В 1843 году лицей был переведен в Санкт-Петербург и переименован в Александровский, продолжая оставаться важным центром образования до своей ликвидации в 1918 году после революции." 
    },
    {
      id:3,
      image: "img/dpt-udelov2.png",
      name: "Департамент уделов",
      description: `Департамент уделов — одно из ключевых государственных учреждений Российской Империи, созданное в 1797 году для управления удельными землями и имуществом, принадлежавшим императорской семье. Департамент занимался сбором доходов с этих земель, а также управлением крестьянами, проживавшими на удельных территориях. В его ведении находились вопросы сельского хозяйства, лесного хозяйства, аренды земель и промышленных предприятий. Департамент уделов играл важную роль в экономике империи, обеспечивая значительную часть доходов императорской семьи. Чиновники департамента занимались также социальными вопросами, такими как образование и здравоохранение для удельных крестьян. После отмены крепостного права в 1861 году департамент продолжил свою деятельность, адаптируясь к новым экономическим условиям. Департамент уделов был упразднен после революции 1917 года, но его архивные материалы остаются важным источником для изучения экономической и социальной истории Российской Империи.`
    },
    { id: 3,
      image: "img/archive-gov2.png", // Можно использовать любое изображение
      name: "Чины и звания в Российской Империи XIX века",
      describtion: `
        В Российской Империи существовала строгая иерархия чинов и званий, которая регулировалась Табелью о рангах, введённой Петром I в 1722 году. Эта система разделялась на гражданские (статские), военные и придворные чины. Каждый чин соответствовал определённому классу, от высшего (I класс) до низшего (XIV класс).
  
        Гражданские (статские) чины:
        - Высшие чины: Канцлер, Действительный тайный советник, Тайный советник.
        - Средние чины: Действительный статский советник, Статский советник, Коллежский советник.
        - Младшие чины: Надворный советник, Коллежский асессор, Титулярный советник.
  
        Военные чины:
        - Высшие чины: Генерал-фельдмаршал, Генерал от инфантерии, Генерал-лейтенант.
        - Средние чины: Генерал-майор, Полковник, Подполковник.
        - Младшие чины: Майор, Капитан, Штабс-капитан, Поручик, Подпоручик, Прапорщик.
  
        Чины определяли не только служебное положение, но и социальный статус. Получение чина давало право на личное или потомственное дворянство, а также на определённые привилегии. Чиновники и военные продвигались по службе в зависимости от заслуг, стажа и личных качеств.
  
        Если информация о конкретном чине отсутствует, это может быть связано с тем, что данные не сохранились или чин не был присвоен.
      `
    },
    { id: 4, 
      image: "img/archive-gov2.png", 
      name: "Архив Государственного Совета",
      describtion: "Историческое учреждение, созданное в Российской империи для хранения документов и материалов, связанных с деятельностью Государственного Совета, высшего законосовещательного органа при императоре. Архив был основан в начале XIX века и играл ключевую роль в систематизации и сохранении важных государственных актов, указов и отчетов. В архиве хранились документы, отражающие процесс принятия решений по важнейшим вопросам внутренней и внешней политики империи. Сотрудники архива занимались не только хранением, но и изучением документов, что способствовало развитию исторической науки. После революции 1917 года архив был реорганизован, а его материалы вошли в состав государственных архивов СССР. Сегодня документы Архива Государственного Совета представляют собой ценный источник для изучения истории России XIX — начала XX веков."
    },
    {
      id:5,
      image: "img/dacha.png",
      name: "Вырица",
      description: `Уютный домик.`
    },
  ];

  const moneyValueHistory = [
    {
      id: 1,
      dates: { start: "1700-01-01", end: "1725-12-31" }, // Начало XVIII века
      image: "img/1700-1725.jpg",
      title: "Ценность денег в начале XVIII века",
      description: "В период правления Петра I рубль стал основной денежной единицей. Стоимость лошади составляла около 3–5 рублей, а годовой доход крестьянина — несколько рублей. Экономика была ориентирована на военные нужды и строительство империи."
    },
    {
      id: 2,
      dates: { start: "1726-01-01", end: "1750-12-31" }, // Первая половина XVIII века
      image: "img/1726-1750.jpg",
      title: "Ценность денег в первой половине XVIII века",
      description: "После Петра I экономика продолжала развиваться. Стоимость коровы составляла около 10 рублей, а годовой доход чиновника среднего звена — 50–100 рублей. Рост торговли и промышленности начал укреплять рубль."
    },
    {
      id: 3,
      dates: { start: "1751-01-01", end: "1775-12-31" }, // Середина XVIII века
      image: "img/1751-1775.jpg",
      title: "Ценность денег в середине XVIII века",
      description: "В период правления Елизаветы Петровны и Екатерины II экономика росла, но войны вызывали инфляцию. Стоимость дома в провинции составляла 200–500 рублей, а годовой доход мелкого чиновника — 100–200 рублей."
    },
    {
      id: 4,
      dates: { start: "1776-01-01", end: "1800-12-31" }, // Конец XVIII века
      image: "img/1776-1800.jpg",
      title: "Ценность денег в конце XVIII века",
      description: "Экономика продолжала развиваться, но войны и расходы на армию вызывали инфляцию. Стоимость лошади составляла 50–100 рублей, а годовой доход рабочего — 100–200 рублей."
    },
    {
      id: 5,
      dates: { start: "1801-01-01", end: "1825-12-31" }, // Начало XIX века
      image: "img/1801-1825.jpg",
      title: "Ценность денег в начале XIX века",
      description: "Война 1812 года сильно ударила по экономике. Стоимость дома в провинции составляла 200–500 рублей, а годовой доход мелкого чиновника — 100–200 рублей."
    },
    {
      id: 6,
      dates: { start: "1826-01-01", end: "1850-12-31" }, // Середина XIX века
      image: "img/1826-1850.jpg",
      title: "Ценность денег в середине XIX века",
      description: "Период правления Николая I. Стоимость лошади составляла 50–100 рублей, а годовой доход рабочего — 100–200 рублей. Экономика оставалась стабильной, но инфляция росла."
    },
    {
      id: 7,
      dates: { start: "1851-01-01", end: "1875-12-31" }, // Вторая половина XIX века
      image: "img/1851-1875.jpg",
      title: "Ценность денег во второй половине XIX века",
      description: "После отмены крепостного права в 1861 году экономика начала меняться. Стоимость квартиры в Москве составляла 1000–2000 рублей, а годовой доход квалифицированного рабочего — 300–500 рублей."
    },
    {
      id: 8,
      dates: { start: "1876-01-01", end: "1900-12-31" }, // Конец XIX века
      image: "img/1876-1900.jpg",
      title: "Ценность денег в конце XIX века",
      description: "Введение золотого стандарта в 1897 году стабилизировало рубль. Стоимость хлеба составляла несколько копеек, а годовой доход рабочего — 500–1000 рублей."
    },
    {
      id: 9,
      dates: { start: "1901-01-01", end: "1917-12-31" }, // Начало XX века
      image: "img/1901-1917.jpg",
      title: "Ценность денег в начале XX века",
      description: "Экономический кризис и Первая мировая война вызвали инфляцию. Стоимость хлеба резко выросла, а годовой доход рабочего составлял 500–1000 рублей, но деньги быстро обесценивались."
    }
  ];

  const tree = [
    {
      "id": "G3M-1VIV-AVV",//* G3M-1VIV-AVV: Generation 3 male - 1 son VIV - AVV (initials)
      "name": "Александр Васильевич",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "22 APR 1804",
      "deathDate": "27 FEB 1858",
      "bio": "Русский военный историк, писатель и педагог, известный своими трудами по истории русской армии и униформы. Он родился в семье военного и с ранних лет проявлял интерес к истории и военному делу. Висковатов служил в Главном штабе русской армии, где занимался систематизацией исторических материалов. Его главный труд — «Историческое описание одежды и вооружения российских войск» — стал фундаментальным исследованием, охватывающим период с древнейших времен до XIX века. Помимо этого, он преподавал в военных учебных заведениях и активно участвовал в научной жизни. Умер Александр Васильевич в 1858 году, оставив после себя богатое наследие, которое до сих пор используется историками и исследователями.",
      "portrait": "1-1"
    },
    {
      "id": "G3F-S1AVV-PFB", //* G3F-SAVV-PFB: Generation 3 female - first spouse AVV - PFB (initials)
      "name": "Паулина Федоровна",
      "surname": "Висковатова",
      "maidenName": "Багговут",
      "sex": "F",
      "birthDate": "16 NOV 1805",
      "deathDate": "2 APR 1869",
      "bio": "Жена Александра Васильевича Висковатова, происходила из знатного рода Багговутов, известного своими военными традициями. Она была дочерью генерал-майора Федора Федоровича Багговута, героя Отечественной войны 1812 года. Паулина Федоровна вышла замуж за Александра Висковатова в 1820-х годах, став верной спутницей и матерью их многочисленных детей. Она поддерживала мужа в его научных и педагогических endeavors, создавая уютную семейную атмосферу. После смерти Александра Васильевича в 1858 году Паулина Федоровна продолжила заботиться о семье и сохранять наследие мужа. Умерла она в 1869 году, оставив после себя память как о преданной жене и матери.",
      "portrait": "1-2"
    },
    {
      "id": "G4M-1AVV-MAV", //* G4M-1AVV-MAV
      "name": "Михаил Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "9 MAR 1830",
      "deathDate": "27 JUL 1830",
      "bio": "",
      "portrait": "2-1"
    },
    {
      "id": "G4M-2AVV-VAV",
      "name": "Василий Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "28 MAR 1832",
      "deathDate": "28 SEP 1902",
      "bio": "",
      "portrait": "2-2"
    },
    {
      "id": "G4M-3AVV-AAV",
      "name": "Александр Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "2 JUL 1833",
      "deathDate": "28 DEC 1906",
      "bio": "",
      "portrait": "2-3"
    },
    {
      "id": "G4M-4AVV-NAV",
      "name": "Николай Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "10 APR 1835",
      "deathDate": "13 JUN 1903",
      "bio": "",
      "portrait": "2-4"
    },
    {
      "id": "G4M-5AVV-KAV",
      "name": "Константин Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "20 FEB 1837",
      "deathDate": "1 NOV 1906",
      "bio": "",
      "portrait": "2-5",
      "family": {
        "parents": ["G3M-1VIV-AVV", "G3F-S1AVV-PFB"],
        "siblings": ["G4M-1AVV-MAV", "G4M-2AVV-VAV", "G4M-3AVV-AAV", "G4M-4AVV-NAV", "G4M-5AVV-KAV", "G4M-6AVV-VAV", "G4F-7AVV-MarAV", "G4M-8AVV-PAV", "G4M-9AVV-ValAV"],
        "spouses": ["G4F-S1AVV-GEM", "G4F-S2AVV-EYK", "G4F-S3AVV-GNG"],
        "kids": ["G5M-1KAV-AKV", "G5F-2KAV-OKV", "G5F-3KAV-EKV", "G5M-4KAV-KKV", "G5F-5KAV-VKV", "G5M-6KAV-FKV", "G5M-7KAV-IKV", "G5M-8KAV-MKV", "G5M-9KAV-AGG", "G5F-10KAV-ElKV"]
      }
    },
    {
      "id": "G4M-6AVV-VAV",
      "name": "Владимир Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "15 AUG 1838",
      "deathDate": null,
      "bio": "",
      "portrait": "2-6"
    },
    {
      "id": "G4F-7AVV-MarAV",
      "name": "Мария Александровна",
      "surname": "Висковатова",
      "maidenName": null,
      "sex": "F",
      "birthDate": "15 AUG 1838",
      "deathDate": "14 APR 1839",
      "bio": "",
      "portrait": "2-7"
    },
    {
      "id": "G4M-8AVV-PAV",
      "name": "Павел Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "24 NOV 1842",
      "deathDate": "16 APR 1905",
      "bio": "",
      "portrait": "2-8"
    },
    {
      "id": "G4M-9AVV-ValAV",
      "name": "Валериан Александрович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "17 SEP 1845",
      "deathDate": "20 JUL 1886",
      "bio": "",
      "portrait": "2-9"
    },
    {
      "id": "G4F-S1AVV-GEM",
      "name": "Генриетта Эдуардовна",
      "surname": "Висковатова",
      "maidenName": "фон Мюральт",
      "sex": "F",
      "birthDate": null,
      "deathDate": "04 JUl 1864",
      "bio": "",
      "portrait": "3-1"
    },
    {
      "id": "G4F-S2AVV-EYK",
      "name": "Елисавета Яковлевна",
      "surname": "Висковатова",
      "maidenName": "Кульнева",
      "sex": "F",
      "birthDate": "10 MAR 1848",
      "deathDate": null,
      "bio": "",
      "portrait": "3-2"
    },
    {
      "id": "G4F-S3AVV-GNG",
      "name": "Генриетта Николаевна",
      "surname": "Висковатова",
      "maidenName": "Гедда",
      "sex": "F",
      "birthDate": "BET 8 OCT 1857 AND 7 OCT 1858",
      "deathDate": "7 OCT 1929",
      "bio": "",
      "portrait": "3-3"
    },
    {
      "id": "G5M-1KAV-AKV",
      "name": "Александр Константинович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "18 MAR 1862",
      "deathDate": null,
      "bio": "",
      "portrait": "4-1"
    },
    {
      "id": "G5F-2KAV-OKV",
      "name": "Ольга Константиновна",
      "surname": "Висковатова",
      "maidenName": null,
      "sex": "F",
      "birthDate": "BET 15 JAN 1878 AND 14 JAN 1879",
      "deathDate": null,
      "bio": "",
      "portrait": "4-2"
    },
    {
      "id": "G5F-3KAV-EKV",
      "name": "Екатерина Константиновна",
      "surname": "Висковатова",
      "maidenName": null,
      "sex": "F",
      "birthDate": "ABT 1888",
      "deathDate": "28 JUL 1888",
      "bio": "",
      "portrait": "4-5"
    },
    {
      "id": "G5M-4KAV-KKV",
      "name": "Константин Константинович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "2 SEP 1886",
      "deathDate": "1953",
      "bio": "",
      "portrait": "4-4"
    },
    {
      "id": "G5F-5KAV-VKV",
      "name": "Вера Константиновна",
      "surname": "Висковатова",
      "maidenName": null,
      "sex": "F",
      "birthDate": "2 SEP 1886",
      "deathDate": null,
      "bio": "",
      "portrait": "4-3"
    },

    {
      "id": "G5M-6KAV-FKV",
      "name": "Федор Константинович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "9 OCT 1889",
      "deathDate": null,
      "bio": "",
      "portrait": "4-6"
    },
    {
      "id": "G5M-7KAV-IKV",
      "name": "Иван Константинович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "4 JAN 1891",
      "deathDate": "FEB 1942",
      "bio": "",
      "portrait": "4-7"
    },
    {
      "id": "G5M-8KAV-MKV",
      "name": "Михаил Константинович",
      "surname": "Висковатов",
      "maidenName": null,
      "sex": "M",
      "birthDate": "4 OCT 1891",
      "deathDate": "25 MAR 1942",
      "bio": "",
      "portrait": "4-8"
    },
    {
      "id": "G5M-9KAV-AGG",
      "name": "Александр Григорьевич",
      "surname": "Григорьев",
      "maidenName": null,
      "sex": "F",
      "birthDate": "19 OCT 1900",
      "deathDate": "5 JAN 1970",
      "bio": "",
      "portrait": "4-9"
    },
    {
      "id": "G5F-10KAV-ElKV",
      "name": "Елизавета Константиновна",
      "surname": "Висковатова",
      "maidenName": null,
      "sex": "F",
      "birthDate": "19 OCT 1900",
      "deathDate": "5 JAN 1970",
      "bio": "",
      "portrait": "4-10"
    }
  ];

  const ranksAndTitles = [
    {
      id: 1,
      name: "Титулярный советник",
      description: "Титулярный советник — гражданский чин IX класса в Табели о рангах, введенный Петром I в 1722 году. Этот чин соответствовал званию капитана в армии или ротмистра в кавалерии. Титулярные советники занимали средние должности в государственных учреждениях, таких как министерства или суды. Получение этого чина давало право на личное дворянство, что делало его важным этапом в карьере чиновника. Они часто выполняли задачи, связанные с делопроизводством и управлением. Этот чин упоминается в литературе, например, у Гоголя в «Шинели»."
    },
    {
      id: 2,
      name: "Коллежский асессор",
      description: "Коллежский асессор — гражданский чин VIII класса, введенный Петром I. Этот чин давал право на потомственное дворянство. Коллежские асессоры занимали ответственные должности в государственных учреждениях, таких как коллегии и министерства. Они часто руководили небольшими отделами или занимались важными административными задачами. Этот чин был одним из самых престижных для среднего звена чиновников. В литературе коллежские асессоры часто изображались как представители среднего класса."
    },
    {
      id: 3,
      name: "Надворный советник",
      description: "Надворный советник — гражданский чин VII класса, введенный в Табели о рангах. Этот чин соответствовал званию подполковника в армии. Надворные советники занимали высокие должности в государственных учреждениях, таких как губернские правления или министерства. Они часто руководили крупными отделами или целыми управлениями. Получение этого чина открывало путь к высшим должностям в государственной службе. Этот чин был важным этапом в карьере чиновника."
    },
    {
      id: 4,
      name: "Коллежский советник",
      description: "Коллежский советник — гражданский чин VI класса, введенный Петром I. Этот чин соответствовал званию полковника в армии. Коллежские советники занимали высокие посты в государственных учреждениях, таких как министерства или губернские правления. Они часто руководили крупными проектами или целыми ведомствами. Получение этого чина означало достижение вершины карьеры для многих чиновников. Этот чин был символом высокого статуса и влияния."
    },
    {
      id: 5,
      name: "Статский советник",
      description: "Статский советник — гражданский чин V класса, один из самых престижных в Табели о рангах. Этот чин соответствовал званию генерал-майора в армии. Статские советники занимали высокие посты в министерствах, губерниях и других государственных учреждениях. Они часто руководили крупными проектами или целыми ведомствами. Получение этого чина означало достижение вершины карьеры для многих чиновников. Этот чин был символом высокого статуса и влияния."
    },
    {
      id: 6,
      name: "Действительный статский советник",
      description: "Действительный статский советник — гражданский чин IV класса, введенный Петром I. Этот чин соответствовал званию генерал-лейтенанта в армии. Действительные статские советники занимали высшие должности в государственных учреждениях, таких как министерства или Сенат. Они часто были советниками императора или руководили крупными регионами. Получение этого чина означало достижение вершины карьеры для чиновника. Этот чин был символом высшего статуса и доверия со стороны власти."
    },
    {
      id: 7,
      name: "Тайный советник",
      description: "Тайный советник — гражданский чин III класса, один из высших в Табели о рангах. Этот чин соответствовал званию генерала от инфантерии в армии. Тайные советники занимали высшие посты в государстве, такие как министры или руководители крупных ведомств. Они часто входили в ближайшее окружение императора и участвовали в принятии важных государственных решений. Получение этого чина означало достижение вершины карьеры и огромное влияние. Этот чин был символом высшей власти и доверия."
    },
    {
      id: 8,
      name: "Действительный тайный советник",
      description: "Действительный тайный советник — гражданский чин II класса, один из самых высоких в Табели о рангах. Этот чин соответствовал званию генерал-фельдмаршала в армии. Действительные тайные советники занимали высшие государственные посты, такие как члены Государственного Совета или руководители ключевых министерств. Они играли ключевую роль в управлении империей и часто были ближайшими советниками императора. Получение этого чина означало достижение вершины власти и влияния. Этот чин был символом высшего доверия и авторитета."
    },
    {
      id: 9,
      name: "Канцлер",
      description: "Канцлер — высший гражданский чин I класса в Табели о рангах. Этот чин соответствовал званию генерал-фельдмаршала в армии. Канцлеры занимали высшие государственные посты, такие как руководители внешнеполитического ведомства или председатели Государственного Совета. Они играли ключевую роль в управлении империей и часто определяли внешнюю и внутреннюю политику. Получение этого чина было крайне редким и означало вершину карьеры. Канцлеры были символами высшей власти и доверия императора."
    },
    {
      id: 10,
      name: "Прапорщик",
      description: "Прапорщик — военный чин XIV класса, самый младший офицерский чин в Российской Империи. Прапорщики выполняли обязанности младших командиров в армии и часто отвечали за обучение солдат. Этот чин был первым шагом в офицерской карьере. Прапорщики не имели права на потомственное дворянство, но могли рассчитывать на повышение. Этот чин был упразднен в 1884 году, но позже восстановлен в XX веке."
    },
    {
      id: 11,
      name: "Подпоручик",
      description: "Подпоручик — военный чин XIII класса, следующий после прапорщика. Подпоручики занимали должности младших офицеров в пехоте и артиллерии. Они отвечали за командование небольшими подразделениями и обучение солдат. Этот чин давал право на личное дворянство. Подпоручики часто начинали свою карьеру в этом чине после окончания военных училищ."
    },
    {
      id: 12,
      name: "Поручик",
      description: "Поручик — военный чин XII класса, следующий после подпоручика. Поручики занимали должности командиров рот или взводов. Они отвечали за боевую подготовку и дисциплину в своих подразделениях. Этот чин давал право на личное дворянство. Поручики часто участвовали в боевых действиях и могли рассчитывать на дальнейшее продвижение по службе."
    },
    {
      id: 13,
      name: "Штабс-капитан",
      description: "Штабс-капитан — военный чин X класса, следующий после поручика. Штабс-капитаны занимали должности заместителей командиров рот или командиров отдельных подразделений. Они отвечали за боевую подготовку и управление личным составом. Этот чин давал право на личное дворянство. Штабс-капитаны часто были опытными офицерами, готовыми к повышению."
    },
    {
      id: 14,
      name: "Капитан",
      description: "Капитан — военный чин IX класса, следующий после штабс-капитана. Капитаны занимали должности командиров рот или батальонов. Они отвечали за боевую подготовку, дисциплину и управление личным составом. Этот чин давал право на личное дворянство. Капитаны часто участвовали в боевых действиях и могли рассчитывать на дальнейшее продвижение по службе."
    },
    {
      id: 15,
      name: "Майор",
      description: "Майор — военный чин VIII класса, следующий после капитана. Майоры занимали должности командиров батальонов или заместителей командиров полков. Они отвечали за боевую подготовку и управление крупными подразделениями. Этот чин давал право на личное дворянство. Майоры часто были опытными офицерами, готовыми к повышению."
    },
    {
      id: 16,
      name: "Подполковник",
      description: "Подполковник — военный чин VII класса, следующий после майора. Подполковники занимали должности заместителей командиров полков или командиров отдельных батальонов. Они отвечали за боевую подготовку и управление крупными подразделениями. Этот чин давал право на личное дворянство. Подполковники часто участвовали в боевых действиях и могли рассчитывать на дальнейшее продвижение по службе."
    },
    {
      id: 17,
      name: "Полковник",
      description: "Полковник — военный чин VI класса, следующий после подполковника. Полковники занимали должности командиров полков или отдельных бригад. Они отвечали за боевую подготовку, дисциплину и управление крупными подразделениями. Этот чин давал право на потомственное дворянство. Полковники часто были опытными командирами, готовыми к повышению."
    },
    {
      id: 18,
      name: "Генерал-майор",
      description: "Генерал-майор — военный чин IV класса, следующий после полковника. Генерал-майоры занимали должности командиров дивизий или отдельных бригад. Они отвечали за боевую подготовку и управление крупными воинскими соединениями. Этот чин давал право на потомственное дворянство. Генерал-майоры часто участвовали в стратегическом планировании и командовании."
    },
    {
      id: 19,
      name: "Генерал-лейтенант",
      description: "Генерал-лейтенант — военный чин III класса, следующий после генерал-майора. Генерал-лейтенанты занимали должности командиров корпусов или армий. Они отвечали за стратегическое планирование и управление крупными воинскими соединениями. Этот чин давал право на потомственное дворянство. Генерал-лейтенанты часто участвовали в важных военных кампаниях."
    },
    {
      id: 20,
      name: "Генерал от инфантерии",
      description: "Генерал от инфантерии — военный чин II класса, один из высших в армии. Генералы от инфантерии занимали должности командующих армиями или фронтами. Они отвечали за стратегическое планирование и управление крупными воинскими соединениями. Этот чин давал право на потомственное дворянство. Генералы от инфантерии часто были ближайшими советниками императора."
    },
    {
      id: 21,
      name: "Генерал-фельдмаршал",
      description: "Генерал-фельдмаршал — высший военный чин I класса в Российской Империи. Генерал-фельдмаршалы занимали высшие посты в армии, такие как командующие фронтами или главнокомандующие. Они отвечали за стратегическое планирование и управление всеми вооруженными силами. Этот чин давал право на потомственное дворянство. Генерал-фельдмаршалы были символами высшей военной власти и доверия императора."
    },
   
    {
      id: 22,
       name: "Коллежский секретарь",
      description: "Коллежский секретарь — гражданский чин X класса в Табели о рангах, введенный Петром I в 1722 году. Этот чин соответствовал званию поручика в армии. Коллежские секретари занимали младшие должности в государственных учреждениях, таких как канцелярии или департаменты. Они часто выполняли задачи, связанные с делопроизводством и ведением документации. Получение этого чина было первым шагом в карьере чиновника. Этот чин упоминается в литературе, например, у Достоевского в «Бедных людях»."
    },
    {
      id: 23,
      name: "Губернский секретарь",
      description: "Губернский секретарь — гражданский чин XII класса, введенный Петром I. Этот чин соответствовал званию подпоручика в армии. Губернские секретари занимали младшие должности в губернских правлениях и других местных учреждениях. Они часто выполняли задачи, связанные с ведением документации и организацией работы канцелярий. Получение этого чина было важным этапом в карьере молодого чиновника. Этот чин упоминается в литературе, например, у Чехова в рассказах о провинциальной жизни."
    },
    {
      id: 24,
      name: "Корабельный секретарь",
      description: "Корабельный секретарь — гражданский чин XII класса, введенный для служащих морского ведомства. Этот чин соответствовал званию подпоручика в армии. Корабельные секретари занимались ведением документации на кораблях и в морских учреждениях. Они отвечали за учет личного состава, снабжения и других аспектов морской службы. Этот чин был важным этапом в карьере морского чиновника. Он упразднен в XIX веке, но оставил след в истории морского ведомства."
    },
    {
      id: 25,
      name: "Канцелярист",
      description: "Канцелярист — гражданский чин XIV класса, самый младший чин в Табели о рангах. Канцеляристы занимались ведением документации и выполнением мелких поручений в государственных учреждениях. Они часто начинали свою карьеру с этого чина, стремясь к повышению. Получение этого чина не давало права на дворянство, но открывало путь к дальнейшему продвижению. Этот чин упоминается в литературе, например, у Гоголя в «Ревизоре»."
    },
    {
      id: 26,
      name: "Регистратор",
      description: "Регистратор — гражданский чин XIV класса, введенный Петром I. Этот чин был самым младшим в иерархии чиновников. Регистраторы занимались ведением записей и регистрацией документов в государственных учреждениях. Они часто начинали свою карьеру с этого чина, стремясь к повышению. Получение этого чина не давало права на дворянство, но открывало путь к дальнейшему продвижению. Этот чин упоминается в литературе, например, у Пушкина в «Станционном смотрителе»."
    }

  ];